local/originalCase/constant/phaseFieldProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseFieldProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

doubleWellFunctionalModel GinzburgLandau;

//- phase-field equation type
phaseFieldEquationType CahnHilliard;

CahnHilliard
{
    //- solution method
    method  segregated;

    coupled
    {
        splittingMethod stable;
        beta    1.0;
    }
}

AllenCahn
{
    nMaxIter 1;
}


//- mobility
phaseFieldMobility
{
    model constant;

    mobilityCoeffs
    {
        kappa0              kappa0 [ -1 3 1 0 0 0 0 ] 12.8e-11; //sqr(epsilon)*0.1

        Yue
        {
            mobilityParameter       0.02;
        }
    }
}


// TODO: remove (needed here for BC)
//- diffuse interface width
diffuseInterface
{
    epsilon                     epsilon [ 0 1 0 0 0 0 0 ] 9e-5; //R/20
}

// ************************************************************************* //
